export const NutriNameList = ["에너지", "단백질(g)", "지질(g)", "탄수화물(g)",   
 					   "총 당류(g)", "식이섬유(g)", "필수 아미노산(mg)",
					   "총 필수 지방산(g)", "총 포화 지방산(g)", "칼슘(mg)", "철(mg)",    
					   "마그네슘(mg)", "인(mg)", "칼륨(mg)", "나트륨(mg)", "아연(mg)", "구리(mg)",    
					   "망간(mg)", "셀레늄(μg)", "몰리브덴(μg)", "요오드(μg)", "레티놀(μg)", "베타카로틴(μg)",	   
					   "비타민D(D2+D3)(μg)", "비타민E(μg)", "비타민K1(μg)", "비타민B1(mg)", "비타민B2(mg)",   
					   "니아신(mg)", "판토텐산(비타민B5)(mg)", "비타민B6(mg)", "비오틴(mg)", "엽산(μg)",    
					   "비타민B12(μg)", "비타민C(mg)", "콜레스테롤(mg)"];

export const NutrientEngNameList = [
	//칼로리
    "energy_Qy",
    //단백질(g)
    "prot_Qy",
    //지질(g)
    "ntrfs_Qy",
    //탄수화물(g)
    "carbohydrate_Qy",
    //총 당류(g)
    "sugar_Qy",
    //총 식이섬유(g)
    "fibtg_Qy",
    //필수 아미노산(mg)
    "aae10a_Qy",
    //총 필수 지방산(g)
    "faessf_Qy",
    //총 포화 지방산(g)
    "fasatf_Qy",
    //칼슘(mg)
    "clci_Qy",
    //철(mg)
    "irn_Qy",
    //마그네슘(mg)
    "mg_Qy",
    //인(mg)
    "phph_Qy",
    //칼륨(mg)
    "ptss_Qy",
    //나트륨(mg)
    "na_Qy",
    //아연(mg)
    "zn_Qy",
    //구리(mg)
    "cu_Qy",
    //망간(mg)
    "mn_Qy",
    //셀레늄(yg)
    "se_Qy",
    //몰리브덴(yg)
    "mo_Qy",
    //요오드(yg)
    "id_Qy",
    //레티놀(yg)
    "rtnl_Qy",
    //비타민 D(D2+D3)(yg)
    "vitd_Qy",
    //비타민 E(yg)
    "vite_Qy",
    //바타민 K1(yg)
    "vitk1_Qy",
    //비타민 B1(mg)
    "vtmn_B1_Qy",
    //비타민 B2(mg)
    "vtmn_B2_Qy",
    //니아신(mg)(mg)
    "nacn_Qy",
    //판토텐산(비타민 B5)(mg)
    "pantac_Qy",
    //비타민 B6 (mg)
    "pyrxn_Qy",
    //비오틴(mg)
    "biot_Qy",
    //엽산(yg)
    "fol_Qy",
    //비타민 B12(yg)
    "vitb12_Qy",
    //비타민 C (mg)
    "vtmn_C_Qy",
    //콜레스테롤(mg)
    "chole_Qy"
]

export const AllFoodList = [
    "간장게장"
    ,"갈비구이"
    ,"갈비찜"
    ,"갈비탕"
    ,"갈치구이"
    ,"갈치조림"
    ,"감자전"
    ,"감자조림"
    ,"감자채볶음"
    ,"감자탕"
    ,"갓김치"
    ,"건새우볶음"
    ,"경단"
    ,"계란국"
    ,"계란말이"
    ,"계란찜"
    ,"계란후라이"
    ,"고등어구이"
    ,"고등어조림"
    ,"고사리나물"
    ,"고추장진미채볶음"
    ,"고추튀김"
    ,"곰탕_설렁탕"
    ,"곱창구이"
    ,"곱창전골"
    ,"과메기"
    ,"김밥"
    ,"김치볶음밥"
    ,"김치전"
    ,"김치찌개"
    ,"김치찜"
    ,"깍두기"
    ,"깻잎장아찌"
    ,"꼬막찜"
    ,"꽁치조림"
    ,"꽈리고추무침"
    ,"꿀떡"
    ,"나박김치"
    
    ,"누룽지"
    ,"닭갈비"
    ,"닭계장"
    ,"닭볶음탕"
    ,"더덕구이"
    ,"도라지무침"
    ,"도토리묵"
    ,"동그랑땡"
    ,"동태찌개"
    ,"된장찌개"
    ,"두부김치"
    ,"두부조림"
    ,"땅콩조림"
    ,"떡갈비"
    ,"떡국_만두국"
    ,"떡꼬치"
    ,"떡볶이"
    ,"라면"
    ,"라볶이"
    ,"막국수"
    ,"만두"
    ,"매운탕"
    ,"멍게"
    ,"메추리알장조림"
    ,"멸치볶음"
    ,"무국"
    ,"무생채"
    ,"물냉면"
    ,"물회"
    ,"미역국"
    ,"미역줄기볶음"
    ,"배추김치"
    ,"백김치"
    ,"보쌈"
    ,"부추김치"
    ,"북엇국"
    ,"불고기"
    ,"비빔냉면"
    ,"비빔밥"
    ,"산낙지"
    ,"삼겹살"
    ,"삼계탕"
    ,"새우볶음밥"
    ,"새우튀김"
    ,"생선전"
    ,"소세지볶음"
    ,"송편"
    ,"수육"
    ,"수제비"
    ,"숙주나물"
    ,"순대"
    ,"순두부찌개"
    ,"시금치나물"
    ,"시래기국"
    ,"알밥"
    ,"애호박볶음"
    ,"약과"
    ,"약식"
    ,"양념게장"
    ,"양념치킨"
    ,"어묵볶음"
    ,"연근조림"
    ,"열무국수"
    ,"열무김치"
    ,"오이소박이"
    ,"오징어채볶음"
    ,"오징어튀김"
    ,"우엉조림"
    ,"유부초밥"
    ,"육개장"
    ,"육회"
    ,"잔치국수"
    ,"잡곡밥"
    ,"잡채"
    ,"장어구이"
    ,"장조림"
    ,"전복죽"
    ,"젓갈"
    ,"제육볶음"
    ,"조개구이"
    ,"조기구이"
    ,"족발"
    ,"주꾸미볶음"
    ,"주먹밥"
    ,"짜장면"
    ,"짬뽕"
    ,"쫄면"
    ,"찜닭"
    ,"총각김치"
    ,"추어탕"
    ,"칼국수"
    ,"코다리조림"
    ,"콩국수"
    ,"콩나물국"
    ,"콩나물무침"
    ,"콩자반"
    ,"파김치"
    ,"파전"
    ,"편육"
    ,"피자"
    ,"한과"
    ,"해물찜"
    ,"호박전"
    ,"호박죽"
    ,"홍어무침"
    ,"황태구이"
    ,"회무침"
    ,"후라이드치킨"
    ,"훈제오리"];